#-------------------------------------------------------元组（不可变操作）---------------------------------
#多值赋值本质上就是元组赋值
'''
def func():
    return 10,20
print(type(func()))
'''
#元组不可变-----如果元组内部包含着可变对象，这样的可变对象是可以修改的，但是对于元组包含的对象的id是不可变的
'''
a = ([1,2],[3,4])
a[0][0] = 100
print(a)
'''

#----------------------------------------------------字典（哈希结构）----------------------------------------
#-------字典存的是键值对结构，其中的键必须是不可变对象，同时还必须是可哈希的
#字典的创建
a = {10: 20, "aa" : "bb"}
#a = dict(10,"aa")

#存在就是查找，不存在就是插入
'''
a["proto"] = "tcp"
print(a)
'''
#删除
#del(a['prot'])
'''
print('prot' in a) #如果是查找操作最好进行先进行存在判定
print(len(a))
print(a.keys())
print(a.values())
print(a.items())
'''
#----------------------------集合（集合是基于字典实现的）--------------------------------------
'''
a = set([1,2,3,4])
b = set([4,3,2,1])
print(a == b)
'''
#并集，交集，差集,对称差集
'''
a = set([1,2,3,4])
b = set([3,4,6,7])
print(a & b)
print(a | b)
print(a - b)
print(a ^ b)
'''
#集合可以去重
a = [1,22,33,11,22,33]
b = list(set(a))
print(b)